import type { NextPage } from "next";

import CustomMotion from "@/components/common/custom-motion";
import ProjectCard from "@/components/common/project-card";

const Project: NextPage = () => {
    return (
        <section className="container pt-32 pb-20 text-center pt">
            <CustomMotion>
                <h4 className="section-heading">Төслүүд</h4>

                <video
                    src="/videos/tusluud.mp4"
                    autoPlay
                    loop
                    muted
                    className="mb-20 rounded-lg aspect-video"
                ></video>
            </CustomMotion>

            <ProjectCard
                id="1"
                name="Арга билиг"
                desc="Бизнес зэрэглэлийн “Арга Билиг” төсөл нь 11,000 мкв талбайд, 5
              блокоос бүрдэх, 800 айлын цогцолбор хотхон юм. Тухайн бүсчлэлдээ
              жишиг болж буй уг бүтээн байгуулалт нь оршин суугчдын хамтын
              харилцааг эрхэмлэсэн коммюнити центр, насны ангилал бүхий хүүхдийн
              тоглоомын талбай, 270 автомашины ил зогсоол болон 250 автомашины
              дулаан зогсоол зэрэг оршин суугчдынхаа хэрэгцээнд тулгуурласан,
              архитекторын ухаалаг төлөвлөлттэй төсөл гэдгээрээ онцлогтой."
                imgSrc="ab"
            />
            <ProjectCard
                id="2"
                name="Florence residence"
                desc="Хүүхэд багачуудын эрүүл энх өсөн торних, хөгжих, эрүүл, аюулгүй орчинг бүрдүүлэх зорилготой “Чухал бүхэнд ойр” Florence Residence төсөл нь хотын төвд хамгийн ойр, үнэ цэнтэй байршилд сүндэрлэж буй цогцолбор хотхон юм. Гэр бүлийн гишүүн бүрийн тав тухад нийцэх оновчтой зохион байгуулалттай, инженерийн зөв шийдлээр баригдаж буй 100 хувь бүрэн цутгамал, 5 блок, 600 айлын төсөл."
                imgSrc="florence"
            />
            <ProjectCard
                id="3"
                name="Plus residence"
                desc="Улаанбаатар хотын “А” зэрэглэлийн бүсэд сүндэрлэж буй PLUS Residence нь хоёр блок, 16 давхар, лобби танхим бүхий 183 айлын бизнес зэрэглэлийн төсөл юм. Барилгуудыг холбох гурван давхар үйлчилгээний төвтэй бөгөөд террас дээр нь хүүхдийн тоглоомын талбайг шийдсэнээрээ онцгой. Цаг хугацаа, тав тухыг эрхэмлэгч, ажил хэрэгч хүмүүсийн хэрэгцээнд нийцүүлэн оффис, худалдаа үйлчилгээ, хүүхдийн цэцэрлэг, фитнес төв гэх мэт хэрэгцээт бүхнийг гэрт ойр байдлаар төлөвлөсөн."
                imgSrc="plus-res"
            />
            <ProjectCard
                id="4"
                name="Plus apartment"
                desc="“Плас Апартмент” төсөл нь Улаанбаатар хотын худалдааны гол бүсэд баригдаж буй бүрэн цутгамал хийцлэлтэй, 16 давхар, стандарт болон дуплекс загварыг хослуулсан, 121 айлын орон сууцны төсөл юм. Орон сууц хүүхдийн тоглоомын талбай, автомашины дулаан болон ил зогсоолтойгоос гадна, дэргэдээ зөвхөн оршин суугчдадаа зориулсан хүүхдийн цэцэрлэг шийдсэнээрээ онцлогтой."
                imgSrc="plus-apart"
            />
            <ProjectCard
                id="5"
                name="LUX 16 apartment"
                desc="Лакс 16 апартмент” нь бүрэн цутгамал хийцлэл бүхий 16 давхар, нэг блок төсөл бөгөөд нэгдүгээр давхартаа үйлчилгээний төв, 2-16 дугаар давхартаа оновчтой, зөв зохион байгуулалт бүхий 2-3 өрөөний сонголттой, 105 айлын орон сууц юм. Гаднаа хүүхдийн тоглоомын талбай, автомашины зогсоолтойгоор шийдсэн нь гэр бүлийн гишүүн бүрийн хэрэгцээнд нийцсэн төлөвлөлт юм."
                imgSrc="lux"
            />
            <ProjectCard
                id="6"
                name="Адмирал апартмент"
                desc="Оршин суугчдын аюулгүй байдал, тав тухыг хангасан 16 давхар 144 айлын орон сууцны төсөл юм."
                imgSrc="lux"
            />
            <ProjectCard
                id="7"
                name="Даланзадгад апартмент 2"
                desc="Даланзадгад Апартмент нь оршин суугчдын аюулгүй байдал, тав тухыг хангасан, олон жилийн туршлагатай, мэргэшсэн хамт олны гүйцэтгэж буй 24 айлын орон сууцны төсөл юм."
                imgSrc="lux"
            />
        </section>
    );
};

export default Project;
